Meta-analysis 从相关研究中整合定量数据，并产生能够总结研究整体的结果。Fixed effect meta-analysis假定所有研究都估计固定的treatment effect。
fixed effect假定所有研究都估计出相同的治疗效果，只是因为取样的偶然（chance）差异导致观察到的treatment effect不同。
合并之前，首先应该进行异质性检验，保证现有的各独立研究间的结果的不同仅仅是由于抽样误差造成的。
若同时如何I2<50%和P≥0.1时，纳入文献被认为是同质的，采用固定效应模型（fixed effect model）分析


#红框：显示的是meta分析里纳入的每一个研究（或效应量）所对应的作者名、年份、Cohen’s d值，置信区间，以及固定效应模型(fixed)和随机效应模型(random)计算出的权重。本次纳入meta分析的研究（或效应量）有6个，因此k=6。

#黄框：显示的是综合效应量的结果。如图可见：固定效应模型（fixed effect model）计算的综合效应量为0.4166，95%CI为[0.2906; 0.5426]，z检验值为6.48，p<0.0001。随机效应模型（random effects model）计算的综合效应量为0.3602，95%CI为[0.1534; 0.5671]，z检验值为3.41，p=0.0006。可以看到这里采用两个模型计算出的显著结果略有不同，研究中通常会采用更加保守的随机效应模型。两个模型的区别：若研究异质性的低于推荐标准值时，应采用固定效应模型（Fixed Effects Model）；而当异质性大于推荐标准值时，应选采用随机效应模型（Randomized Effects Model）进行meta分析。

#蓝框：显示的是异质性检验的结果。主要看Q检验（检验水准为α=0.1）的结果，以及I^2值（0～100%），一般来讲，I^2值0%-25%为低异质性, 50%-75%为中等异质性，>75%为高异质性。异质性越高，代表纳入的研究（或效应量）间差异越大，在实证研究中，这种差异可能是由于实验范式、被试特征、施策时间、施策地点差异等造成，因此大部分meta分析会进一步假设可能的影响因素，再做亚组分析。

I2：研究之间真实异质性占总变异的比重
